In [5]:
import pandas as pd, numpy as np

In [11]:
tips = pd.read_csv('D:\Ryzen1700\Study\ML\Dataset\pydata-book-2nd-edition\pydata-book-2nd-edition\examples\\tips.csv')

In [12]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [13]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [14]:
top(tips)

     total_bill   tip smoker  day    time  size   tip_pct
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [16]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [19]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [20]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [21]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [22]:
result.unstack()

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [25]:
f = lambda x:x.describe()
tips.groupby('smoker')['tip_pct'].apply(f)

smoker
No      count    151.000000
        mean       0.159328
        std        0.039910
        min        0.056797
        25%        0.136906
        50%        0.155625
        75%        0.185014
        max        0.291990
Yes     count     93.000000
        mean       0.163196
        std        0.085119
        min        0.035638
        25%        0.106771
        50%        0.153846
        75%        0.195059
        max        0.710345
Name: tip_pct, dtype: float64

# Suppressing the Group Keys

In [30]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

# Quantile and Bucket Analysis

In [31]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)
                     })

In [33]:
quartiles = pd.cut(frame['data1'], 4)

In [35]:
quartiles[:10]

0    (-1.466, 0.126]
1    (-1.466, 0.126]
2    (-1.466, 0.126]
3     (0.126, 1.718]
4    (-1.466, 0.126]
5     (0.126, 1.718]
6    (-1.466, 0.126]
7    (-1.466, 0.126]
8     (0.126, 1.718]
9     (0.126, 1.718]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.064, -1.466] < (-1.466, 0.126] < (0.126, 1.718] < (1.718, 3.31]]

In [44]:
grouped = frame['data2'].groupby(quartiles).apply(f)

In [46]:
grouped.unstack()

,count,mean,std,min,25%,50%,75%,max
data1,,,,,,,,
"(-3.064, -1.466]",67.0,0.165638,1.152929,-2.997172,-0.438948,0.158722,0.716536,2.621019
"(-1.466, 0.126]",501.0,0.068156,0.996900,-3.268924,-0.554730,0.047171,0.703972,3.066364
"(0.126, 1.718]",384.0,-0.057051,1.009098,-2.454378,-0.743386,-0.074458,0.628069,3.289583
"(1.718, 3.31]",48.0,0.022108,1.006677,-2.444406,-0.686926,-0.078561,0.857714,1.842395

In [47]:
grouping = pd.qcut(frame['data1'], 10, labels=False)

In [49]:
grouped = frame.data2.groupby(grouping)

In [51]:
grouped.apply(f).unstack()

,count,mean,std,min,25%,50%,75%,max
data1,,,,,,,,
0,100.0,0.085440,1.072273,-2.997172,-0.456264,0.076117,0.598541,2.621019
1,100.0,-0.058686,0.968415,-2.709310,-0.637268,0.044316,0.524713,2.548967
2,100.0,0.137397,1.048412,-2.104605,-0.578904,0.130976,0.884036,2.389299
3,100.0,0.143866,0.941239,-2.343912,-0.474703,0.035819,0.742215,2.928919
4,100.0,-0.060110,1.023316,-3.268924,-0.700586,-0.103877,0.493574,3.066364
5,100.0,0.180164,1.039009,-2.172109,-0.408353,0.236592,0.845963,2.769992
6,100.0,0.008906,1.148385,-2.454378,-0.856766,-0.078737,0.749453,3.289583
7,100.0,-0.180350,0.952082,-2.296991,-0.851667,-0.188621,0.467419,1.800657
8,100.0,0.017642,0.920040,-2.300357,-0.547660,0.011342,0.681874,2.376764
9,100.0,-0.030295,0.994125,-2.444406,-0.741000,-0.152980,0.700978,2.441486

# Filling Missing Values with Group-Specific Values

In [52]:
s = pd.Series(np.random.randn(6))

In [56]:
s[::2]  = np.nan

In [57]:
s

0         NaN
1   -0.762710
2         NaN
3    1.153220
4         NaN
5   -0.666634
dtype: float64

In [58]:
s.fillna(s.mean())

0   -0.092041
1   -0.762710
2   -0.092041
3    1.153220
4   -0.092041
5   -0.666634
dtype: float64

In [59]:
states = ['Ohio', 'New York', 'Vermont', 'Florida', 'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

Ohio         -0.222240
New York     -1.201240
Vermont      -1.136244
Florida       0.674436
Oregon       -0.866342
Nevada        0.104139
California   -0.223123
Idaho        -0.558216
dtype: float64

In [60]:
data[['Vermont','Nevada', 'Idaho']] = np.nan

In [61]:
data

Ohio         -0.222240
New York     -1.201240
Vermont            NaN
Florida       0.674436
Oregon       -0.866342
Nevada             NaN
California   -0.223123
Idaho              NaN
dtype: float64

In [62]:
data.groupby(group_key).mean()

East   -0.249681
West   -0.544732
dtype: float64

In [63]:
fill_mean = lambda g: g.fillna(g.mean())

In [64]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.222240
New York     -1.201240
Vermont      -0.249681
Florida       0.674436
Oregon       -0.866342
Nevada       -0.544732
California   -0.223123
Idaho        -0.544732
dtype: float64

# Predefined fill values in your code that vary by group.

In [66]:
fill_values = {'East':0.5, 'West':-1}
fill_func = lambda g : g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

Ohio         -0.222240
New York     -1.201240
Vermont       0.500000
Florida       0.674436
Oregon       -0.866342
Nevada       -1.000000
California   -0.223123
Idaho        -1.000000
dtype: float64

# Random Sampling and Permutation

In [68]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1,11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2,11)) + ['J', 'K', 'Q']
cards = []
for suit in suits:
    cards.extend( str(num) + suit for num in base_names )
deck = pd.Series(card_val, index=cards)
deck[:5]

AH    1
2H    2
3H    3
4H    4
5H    5
dtype: int64

In [69]:
def draw(deck, n=5):
    return deck.sample(n)

In [70]:
draw(deck)

7D    7
5C    5
7H    7
3H    3
9H    9
dtype: int64

In [71]:
get_suit = lambda card: card[-1] #last letter is suit

In [72]:
deck.groupby(get_suit).apply(draw, n=2)

C  QC    10
   6C     6
D  3D     3
   AD     1
H  9H     9
   8H     8
S  4S     4
   6S     6
dtype: int64

In [73]:
#or
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

QC    10
5C     5
KD    10
8D     8
KH    10
4H     4
6S     6
5S     5
dtype: int64

# Group Weighted Average and Correlation

In [75]:
df = pd.DataFrame({'category': ['a','a','a','a','b','b','b','b'],
                   'data': np.random.randn(8),
                   'weights': np.random.randn(8)
                  })

In [76]:
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

category
a    0.411931
b    1.763589
dtype: float64

In [6]:
close_px = pd.read_csv('D:\Ryzen1700\Study\ML\Dataset\pydata-book-2nd-edition\pydata-book-2nd-edition\examples\\stock_px_2.csv', parse_dates=True, index_col=0)

In [7]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [8]:
close_px

              AAPL   MSFT    XOM      SPX
2003-01-02    7.40  21.11  29.22   909.03
2003-01-03    7.45  21.14  29.24   908.59
2003-01-06    7.45  21.52  29.96   929.01
2003-01-07    7.43  21.93  28.95   922.93
2003-01-08    7.28  21.31  28.83   909.93
...            ...    ...    ...      ...
2011-10-10  388.81  26.94  76.28  1194.89
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

[2214 rows x 4 columns]

In [9]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [10]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [11]:
rets = close_px.pct_change().dropna()

In [12]:
#rets.iloc[1].name.year

In [13]:
get_year = lambda x : x.year

In [14]:
by_year = rets.groupby(get_year)

In [15]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

Compute inter-column correlations

In [16]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

# Group-wise Linear Regression

In [17]:
import statsmodels.api as sm

In [18]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] =1.
    result = sm.OLS(Y,X).fit()
    return result.params

In [22]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514